#### clean data

In [1]:
import pandas as pd
import numpy as np

In [2]:
# find dataframe
dataframe_dirty = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
dataframe_dirty

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
flightnum = dataframe_dirty['FlightNumber'].tolist()
flightnum

[10045.0, nan, 10065.0, nan, 10085.0]

In [5]:
def is_nan(item):
    return (item is np.nan or item != item)

def return_int(float_number):
    return int(float_number)

In [7]:
new_flight = []
current_number = 0
for ind, val in enumerate(flightnum):
    print('{} is nan: {}'.format(val, is_nan(val)))
    # change first value to an integer
    if ind == 0:
        val = return_int(val)
        current_number = val
        new_flight.append(val)
    else:
        if is_nan(val):
            current_number += 10
            new_flight.append(current_number)
        else:
            val = return_int(val)
            current_number = val
            new_flight.append(val)
    print('current number is {}.'.format(current_number))

10045.0 is nan: False
current number is 10045.
nan is nan: True
current number is 10055.
10065.0 is nan: False
current number is 10065.
nan is nan: True
current number is 10075.
10085.0 is nan: False
current number is 10085.

In [8]:
new_flight

[10045, 10055, 10065, 10075, 10085]

In [9]:
dataframe_tmp = dataframe_dirty
dataframe_tmp['FlightNumber'] = new_flight

In [10]:
dataframe_tmp

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [11]:
from_to_list = dataframe_tmp['From_To'].tolist()
from_to_list

['LoNDon_paris',
 'MAdrid_miLAN',
 'londON_StockhOlm',
 'Budapest_PaRis',
 'Brussels_londOn']

In [14]:
for s in from_to_list:
    print(s.split('_'))

['LoNDon', 'paris']
['MAdrid', 'miLAN']
['londON', 'StockhOlm']
['Budapest', 'PaRis']
['Brussels', 'londOn']

In [20]:
def return_split_string(compound_string, split_item):
    return compound_string.split(split_item)

In [22]:
separator = '_'
from_list = []
to_list = []

for travel_data in from_to_list:
    start_location, end_location = return_split_string(travel_data, separator)
    start_location = start_location.capitalize()
    end_location = end_location.capitalize()
    print('Trip starts @ {} and ends @ {}.'.format(start_location, end_location))
    from_list.append(start_location)
    to_list.append(end_location)

Trip starts @ London and ends @ Paris.
Trip starts @ Madrid and ends @ Milan.
Trip starts @ London and ends @ Stockholm.
Trip starts @ Budapest and ends @ Paris.
Trip starts @ Brussels and ends @ London.

In [23]:
from_list

['London', 'Madrid', 'London', 'Budapest', 'Brussels']

In [24]:
to_list

['Paris', 'Milan', 'Stockholm', 'Paris', 'London']

In [25]:
dataframe_tmp.insert(0, 'To', to_list)

In [27]:
dataframe_tmp.insert(0, 'From', from_list)

In [28]:
dataframe_tmp

,From,To,From_To,FlightNumber,RecentDelays,Airline
0,London,Paris,LoNDon_paris,10045,"[23, 47]",KLM(!)
1,Madrid,Milan,MAdrid_miLAN,10055,[],<Air France> (12)
2,London,Stockholm,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. )
3,Budapest,Paris,Budapest_PaRis,10075,[13],12. Air France
4,Brussels,London,Brussels_londOn,10085,"[67, 32]","""Swiss Air"""

In [30]:
dataframe_tmp.drop(columns=['From_To'], inplace=True)

In [31]:
dataframe_tmp

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

In [32]:
delays_list = dataframe_tmp['RecentDelays'].tolist()

In [33]:
delays_list

[[23, 47], [], [24, 43, 87], [13], [67, 32]]

In [35]:
def longest_list(list_of_lists):
    longest = 0
    for l in list_of_lists:
        length = len(l)
        print('current longest is {} and new length is {}'.format(longest, length))
        if length > longest:
            longest = length
    return longest

In [36]:
max_delays = longest_list(delays_list)

current longest is 0 and new length is 2
current longest is 2 and new length is 0
current longest is 2 and new length is 3
current longest is 3 and new length is 1
current longest is 3 and new length is 2

In [37]:
max_delays

3

In [69]:
def add_nans(alist, number_of_nans):
    for i in range(number_of_nans):
        alist.append(np.nan)
    return alist

def add_available(old_list, available_numbers):
    result = []
    if available_numbers > 0:
        for item in old_list:
            result.append(item)
    return result

In [70]:
new_delays_list = []
tmp_list = []
start_ind = 0
for ind, delays in enumerate(delays_list):
    print(delays)
    if len(delays) < max_delays:
        nans_to_add = max_delays - len(delays)
        available = len(delays)
        end = available + nans_to_add
        print('available numbers: {}'.format(available))
        tmp_list = add_available(delays, available)
        print('add {} nans'.format(nans_to_add))
        tmp_list = add_nans(tmp_list, nans_to_add)
        print(tmp_list)
        new_delays_list.append(tmp_list)
    else:
        print("don't add any nans")
        new_delays_list.append(delays)

[23, 47]
available numbers: 2
add 1 nans
[23, 47, nan]
[]
available numbers: 0
add 3 nans
[nan, nan, nan]
[24, 43, 87]
don't add any nans
[13]
available numbers: 1
add 2 nans
[13, nan, nan]
[67, 32]
available numbers: 2
add 1 nans
[67, 32, nan]

In [71]:
new_delays_list

[[23, 47, nan], [nan, nan, nan], [24, 43, 87], [13, nan, nan], [67, 32, nan]]

In [72]:
delay_1 = []
delay_2 = []
delay_3 = []

In [73]:
for delays in new_delays_list:
    delay_1.append(delays[0])
    delay_2.append(delays[1])
    delay_3.append(delays[2])

In [74]:
delay_1

[23, nan, 24, 13, 67]

In [75]:
delay_2

[47, nan, 43, nan, 32]

In [76]:
delay_3

[nan, nan, 87, nan, nan]

In [77]:
dataframe_tmp['RecentDelays'] = new_delays_list

In [78]:
dataframe_tmp

       From         To  FlightNumber     RecentDelays              Airline
0    London      Paris         10045    [23, 47, nan]               KLM(!)
1    Madrid      Milan         10055  [nan, nan, nan]    <Air France> (12)
2    London  Stockholm         10065     [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075   [13, nan, nan]       12. Air France
4  Brussels     London         10085    [67, 32, nan]          "Swiss Air"

In [79]:
dataframe_tmp.insert(4, 'Delay_3', delay_3)

In [80]:
dataframe_tmp.insert(4, 'Delay_2', delay_2)

In [81]:
dataframe_tmp.insert(4, 'Delay_1', delay_1)

In [82]:
dataframe_tmp

,From,To,FlightNumber,RecentDelays,Delay_1,Delay_2,Delay_3,Airline
0,London,Paris,10045,"[23, 47, nan]",23.0,47.0,NaN,KLM(!)
1,Madrid,Milan,10055,"[nan, nan, nan]",NaN,NaN,NaN,<Air France> (12)
2,London,Stockholm,10065,"[24, 43, 87]",24.0,43.0,87.0,(British Airways. )
3,Budapest,Paris,10075,"[13, nan, nan]",13.0,NaN,NaN,12. Air France
4,Brussels,London,10085,"[67, 32, nan]",67.0,32.0,NaN,"""Swiss Air"""

In [83]:
dataframe_tmp.columns.values[3] = 'Delays'

In [84]:
dataframe_tmp

,From,To,FlightNumber,Delays,Delay_1,Delay_2,Delay_3,Airline
0,London,Paris,10045,"[23, 47, nan]",23.0,47.0,NaN,KLM(!)
1,Madrid,Milan,10055,"[nan, nan, nan]",NaN,NaN,NaN,<Air France> (12)
2,London,Stockholm,10065,"[24, 43, 87]",24.0,43.0,87.0,(British Airways. )
3,Budapest,Paris,10075,"[13, nan, nan]",13.0,NaN,NaN,12. Air France
4,Brussels,London,10085,"[67, 32, nan]",67.0,32.0,NaN,"""Swiss Air"""